## TB Data

In [85]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [86]:
lf = pd.read_csv( 'tb_tidy.csv' )
#bring in data

In [87]:
lf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11492 entries, 0 to 11491
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   country       11492 non-null  object
 1   year          11492 non-null  int64
 2   sex           11492 non-null  object
 3   total_number  11492 non-null  float64
dtypes: float64(1), int64(1), object(2)
memory usage: 359.2+ KB

In [88]:
lf.head()

  country  year sex  total_number
0      AD  1989   f           0.0
1      AD  1989   m           0.0
2      AD  1990   f           0.0
3      AD  1990   m           0.0
4      AD  1991   f           0.0

In [89]:
lf.nunique()

country          212
year              29
sex                2
total_number    2415
dtype: int64

In [90]:
country_info = lf.groupby(['country']).size().reset_index(name='num_rows')
country_info.drop(columns=['num_rows'], inplace=True)
# broke the tidy table into country_info to get rid of the redundancy of country in the main tidy dataset

In [91]:
country_info

    country
0        AD
1        AE
2        AF
3        AG
4        AI
..      ...
207      YE
208      YU
209      ZA
210      ZM
211      ZW

[212 rows x 1 columns]

In [92]:
country_info['country_id'] = country_info.index + 1

In [93]:
country_info

    country  country_id
0        AD           1
1        AE           2
2        AF           3
3        AG           4
4        AI           5
..      ...         ...
207      YE         208
208      YU         209
209      ZA         210
210      ZM         211
211      ZW         212

[212 rows x 2 columns]

In [94]:
sex_info = lf.groupby(['sex']).size().reset_index(name='num_rows')
sex_info.drop(columns=['num_rows'], inplace=True)
# created this table in order to get rid of redundancy of sex in the main tidy table/organization

In [95]:
sex_info

  sex
0   f
1   m

In [96]:
sex_info['sex_id'] = sex_info.index + 1

In [97]:
sex_info

  sex  sex_id
0   f       1
1   m       2

In [98]:
lf_copy = pd.merge( lf, country_info.loc[:, ['country_id', 'country']], on='country', how='left').\
merge(sex_info.loc[:, ['sex', 'sex_id']], on='sex', how='left')

In [99]:
lf_copy.drop(columns=['country', 'sex'], inplace=True)

In [100]:
lf_copy.head()

   year  total_number  country_id  sex_id
0  1989           0.0           1       1
1  1989           0.0           1       2
2  1990           0.0           1       1
3  1990           0.0           1       2
4  1991           0.0           1       1

In [101]:
tb_per_year = lf_copy.copy()

In [102]:
tb_per_year['id'] = tb_per_year.index + 1

In [103]:
tb_per_year.head()

   year  total_number  country_id  sex_id  id
0  1989           0.0           1       1   1
1  1989           0.0           1       2   2
2  1990           0.0           1       1   3
3  1990           0.0           1       2   4
4  1991           0.0           1       1   5

In [106]:
#recreate tidy dataset
r_lf = pd.merge( tb_per_year, country_info.loc[:, ['country_id', 'country']], on='country_id', how='left').\
merge(sex_info.loc[:, ['sex', 'sex_id']], on='sex_id', how='left')

In [107]:
r_lf.head()

   year  total_number  country_id  sex_id  id country sex
0  1989           0.0           1       1   1      AD   f
1  1989           0.0           1       2   2      AD   m
2  1990           0.0           1       1   3      AD   f
3  1990           0.0           1       2   4      AD   m
4  1991           0.0           1       1   5      AD   f

In [108]:
r_lf.drop(columns=['country_id','sex_id','id'], inplace=True)

In [109]:
r_lf.head()
# recreated the original tidy data set from its parts

   year  total_number country sex
0  1989           0.0      AD   f
1  1989           0.0      AD   m
2  1990           0.0      AD   f
3  1990           0.0      AD   m
4  1991           0.0      AD   f

## Save the datasets

In [62]:
country_info.to_csv('country_info.csv', header=True, index=False)

In [63]:
sex_info.to_csv('sex_info.csv', header=True, index=False)

In [64]:
tb_per_year.to_csv('tb_per_year.csv', header=True, index=False)